openfoam/NASA_hump_data_coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       51430;
    }
    topWall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          520;
        startFace       51480;
    }
    jet
    {
        type            patch;
        nFaces          40;
        startFace       52000;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       52040;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          480;
        startFace       52090;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          52000;
        startFace       52570;
    }
)

// ************************************************************************* //
