openfoam/NASA_hump_data_coarse/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       ABS_TOL;
        relTol          0.001;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    Phi
    {
        $p;
    }
    "(U|epsilon|k|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       ABS_TOL;
        relTol          0.001;
    }

    nuTilda
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       ABS_TOL;
        relTol          0.001;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               RES_TOL;
        U               RES_TOL;
        nuTilda         RES_TOL;
        epsilon         RES_TOL;
        k               RES_TOL;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 0;
    PhiRefCell        0;
    PhiRefValue       0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        epsilon         0.7;
        k               0.7;
        nuTilda         0.7;
    }
}


// ************************************************************************* //
